In [1]:
import pandas as pd

## 예제 1-8 결측값으로 인스턴스 생성

In [2]:
import numpy as np

In [3]:
df_na = pd.DataFrame([1,2,np.nan])

In [4]:
df_na

     0
0  1.0
1  2.0
2  NaN

In [5]:
df_na.sum()

0    3.0
dtype: float64

In [6]:
# skipna 은 기본 값이 True이며 False로 명시적으로 주어졌을 경우 NaN을 포함하며 연산을 한다.
# 이때 모든 NaN 값의 연산은 NaN으로 표기함
df_na.sum(skipna=False)

0   NaN
dtype: float64

In [7]:
df_na < 3

       0
0   True
1   True
2  False

In [9]:
df_na < 2

       0
0   True
1  False
2  False

In [10]:
df_na < np.nan

       0
0  False
1  False
2  False

In [11]:
df_na > np.nan

       0
0  False
1  False
2  False

In [12]:
#비교 연산은 결측값 (누락값)에서 사용할 수 없다
df_na == np.nan

       0
0  False
1  False
2  False